//GPAZ99J3 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=CGPRG010
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
1100SP1200200S97006790
1101SP0700300S38001060
2200MG0300200N53003840
2201MG0080100S12000850
3300RJ0510450S37501789
3301RJ0350300N28700557
4400ES1330200S83217841
4401ES0887000S72474850
5500PR0122400S84216257
5501PR0024500N01450025
6600SC0056400S02300111
6601SC0001200S00450020
7700RS0054600S75125422
7701RS0012400S32101250
9999999999999999999999
//*
//CADGRAVJ DD DSN=GP.GPAZ99.CG010.CADGRAVA,DISP=(NEW,CATLG,DELETE),
//        SPACE=(TRK,(1,1)),UNIT=SYSALLDA,
//        DCB=(LRECL=27,RECFM=FB,DSORG=PS)
//*
